/* Сформируйте трёхмерный массив из неповторяющихся двузначных чисел. Напишите программу,
которая будет построчно выводить массив, добавляя индексы каждого элемента.
Массив размером 2 x 2 x 2
66(0,0,0) 25(0,1,0)
34(1,0,0) 41(1,1,0)
27(0,0,1) 90(0,1,1)
26(1,0,1) 55(1,1,1)
*/
int[,,] matrix3D = new int [2,2,2]
{
    {{66, 25}, {34, 41}},
    {{27, 90}, {26, 55}}};

void PrintArray(int[,,] mas)
{
    for (int i =0; i < mas.GetLength(0); i++)
    {
        for (int j = 0; j < mas.GetLength(1); j++)
        {
            for (int a = 0; a < mas.GetLength(2); a++)
            {
                 Console.Write($"{mas[i,j,a]} ({i},{j},{a}) ");
            }
           Console.WriteLine();
        }
    }
}
PrintArray(matrix3D);