// Напишите программу, которая на вход принимает число и выдает его квадрат
//Число умноженное на само себя.
Console.WriteLine("Вееди число");

int a = int.Parse(Console.ReadLine()!);
int b = a * a;

Console.WriteLine(b);

